#pragma once
#include<SFML\Graphics.hpp>

const int BLOCK_SIZE = 18; //размер блока в пикселях
const int FIELD_WIDTH = 10; //ширина поля  
const int FIELD_HEIGHT = 20; //высота поля 
const int SCORES[] = { 10, 30, 70, 150 }; //очки за собранные линии 
using namespace sf;

//массив фигур
const int SHAPES[7][5][4] = {
	{ { 0, 0, 0, 0 },{ 1, 1, 1, 1 },{ 0, 0, 0, 0 },{ 0, 0, 0, 0 },{ 4 } }, //I
	{ { 0, 0, 0, 0 },{ 0, 1, 1, 0 },{ 0, 1, 1, 0 },{ 0, 0, 0, 0 },{ 4 } }, //O
	{ { 0, 1, 1, 0 },{ 1, 1, 0, 0 },{ 0, 0, 0, 0 },{ 0, 0, 0, 0 },{ 3 } }, //S
	{ { 1, 1, 0, 0 },{ 0, 1, 1, 0 },{ 0, 0, 0, 0 },{ 0, 0, 0, 0 },{ 3 } }, //Z
	{ { 1, 0, 0, 0 },{ 1, 1, 1, 0 },{ 0, 0, 0, 0 },{ 0, 0, 0, 0 },{ 3 } }, //J
	{ { 0, 0, 1, 0 },{ 1, 1, 1, 0 },{ 0, 0, 0, 0 },{ 0, 0, 0, 0 },{ 3 } }, //L	
	{ { 0, 1, 0, 0 },{ 1, 1, 1, 0 },{ 0, 0, 0, 0 },{ 0, 0, 0, 0 },{ 3 } }  //T	
};

//поле
extern int field[FIELD_HEIGHT + 1][FIELD_WIDTH];


	
